{
  "patient_info": {
    "등록번호": "123",
    "환자명": "김민준",
    "수술명": "위궤양 천공으로 인한 위절제술",
    "나이": "23",
    "성별": "M",
    "시행예정일": "2025-07-10",
    "진단명": "Small intestine perforation (소장 천공)",
    "수술부위표시": "Both",
    "수술부위": "좌측",
    "의료진": [
      {
        "집도의": "서원",
        "전문의여부": "전문의",
        "진료과목": "외과"
      }
    ]
  },
  "form_data": {
    "registration_no": "123",
    "patient_name": "김민준",
    "surgery_name": "위궤양 천공으로 인한 위절제술",
    "age": "23",
    "gender": "M",
    "scheduled_date": "2025-07-10",
    "diagnosis": "Small intestine perforation (소장 천공)",
    "surgical_site_mark": "Both",
    "surgical_site_detail": "좌측",
    "past_history": "무",
    "diabetes": "무",
    "smoking": "유",
    "hypertension": "무",
    "allergy": "유",
    "cardiovascular": "무",
    "respiratory": "무",
    "coagulation": "무",
    "medications": "무",
    "renal": "유",
    "drug_abuse": "무",
    "other": "",
    "operator_1": "서원",
    "specialist_1": "전문의",
    "department_1": "외과",
    "operator_2": "",
    "specialist_2": "전문의",
    "department_2": "",
    "operator_3": "",
    "specialist_3": "전문의",
    "department_3": ""
  },
  "session_consent_data": {
    "no_surgery_prognosis": "수술을 받지 않으면 소장 천공(장에 구멍이 난 상태) 때문에 복강 내에 음식물과 세균이 퍼져 심각한 복막염이 생길 수 있습니다. 복막염은 몸 전체에 염증이 퍼져 고열, 심한 복통, 구토, 혈압 저하 등으로 이어질 수 있습니다. 치료하지 않으면 장기 기능이 빠르게 나빠지고, 패혈증(온몸에 세균이 퍼지는 상태)으로 생명이 위험해질 수 있습니다. 젊고 건강해 보여도, 이런 상태에서는 몸이 버티기 어렵습니다. 약물치료나 안정만으로는 구멍이 막히지 않기 때문에, 대부분의 환자에게 수술이 꼭 필요합니다. 수술을 미루거나 받지 않으면 회복이 거의 불가능하며, 심한 경우 사망에 이를 수 있습니다. 즉, 수술 없이 자연적으로 좋아질 가능성은 매우 낮습니다.",
    "alternative_methods": "위궤양이나 소장 천공이 생겼을 때, 가장 효과적인 치료는 수술입니다. 하지만 상황에 따라 다른 방법들도 고려할 수 있습니다. 먼저, 환자가 매우 약하거나 수술이 위험할 때는 약물치료와 금식, 수액치료 등으로 상태를 안정시키는 시도를 할 수 있습니다. 그러나 이런 방법은 천공이 작고, 감염이 심하지 않을 때만 가능합니다. 대부분의 경우에는 천공 부위를 막거나, 손상된 장기를 일부 절제하는 수술이 필요합니다. 만약 암이 있는 경우에는 특별히 기다리면서 경과를 지켜보는 방법도 있지만, 일반적인 천공에는 잘 적용되지 않습니다. 수술을 하지 않으면 복막염이나 심각한 감염이 생길 수 있어 생명이 위험해질 수 있습니다. 따라서 수술이 가장 안전하고 효과적인 치료법으로 권장됩니다. 환자 상태에 따라 담당 의사가 가장 적합한 치료 방법을 설명해 드릴 것입니다.",
    "purpose": "위절제술은 위궤양이나 소장 천공처럼 위나 장에 구멍이 생긴 경우에 시행하는 수술입니다. 이 구멍을 그대로 두면 음식물이나 세균이 배 안으로 새어나가 심각한 감염이나 생명에 위협이 될 수 있습니다. 수술을 통해 손상된 위의 일부를 잘라내고, 남은 위와 장을 다시 연결하여 정상적으로 소화가 되도록 합니다. 이런 수술은 구멍이 생긴 부위를 막고, 감염을 막기 위해 꼭 필요합니다. 만약 수술을 하지 않으면 복막염이나 패혈증 같은 위험한 합병증이 생길 수 있습니다. 수술 후에는 위의 크기가 줄어들 수 있어 식사량이 줄거나 소화가 달라질 수 있습니다. 하지만 수술을 통해 생명을 지키고, 앞으로의 건강을 위해 꼭 필요한 치료입니다. 수술 후에는 회복을 위해 일정 기간 동안 음식 섭취나 활동에 제한이 있을 수 있습니다.",
    "method_1": "이 수술은 위궤양이나 소장 천공처럼 위나 장에 구멍이 생긴 경우에 시행하는 위절제술입니다. 위절제술은 손상된 위의 일부를 잘라내는 수술로, 구멍이 난 부위를 막고 감염을 막기 위해 필요합니다. 천공이 생기면 음식물이나 세균이 배 안으로 새어나가 심각한 감염이 생길 수 있으므로, 빠른 수술이 중요합니다. 수술 후에는 위의 크기가 줄어들 수 있어 식사 습관을 바꿔야 할 수도 있습니다. 수술 중에는 출혈, 감염, 주변 장기 손상 같은 위험이 있을 수 있지만, 이런 합병증을 줄이기 위해 전문 의료진이 신경 써서 진행합니다. 평소 신장(콩팥) 질환이나 알레르기가 있다면, 수술 전후로 특별히 더 주의해서 치료를 받게 됩니다. 수술 후에는 회복을 위해 일정 기간 입원이 필요할 수 있습니다. 이 수술은 생명을 지키기 위해 꼭 필요한 치료 방법입니다.",
    "method_2": "수술 예상 소요 시간은 환자의 상태와 수술 종류에 따라 달라져요. 위궤양 천공으로 인한 위절제술은 복잡한 수술이라서 시간이 조금 더 걸릴 수 있어요. 환자가 안정되는 데 시간이 필요한 경우도 있어요. 수술 중에 발생할 수 있는 일들을 미리 대비해서 시간을 예상해요. 수술이 잘 진행되고 환자가 안전하게 회복되기까지 시간이 필요해요. 수술 예상 소요 시간은 약 3~4시간 정도일 수 있어요.",
    "method_3": "수술 중에 예상치 못한 상황이 생길 수 있습니다. 예를 들어, 위나 소장 주변에 손상이 더 넓게 퍼져 있거나, 출혈이 심한 경우가 있을 수 있습니다. 이런 경우에는 원래 계획했던 위절제술보다 더 넓은 부위를 절제하거나, 추가로 소장 일부를 절제해야 할 수도 있습니다. 또, 환자의 상태가 불안정해지면 위와 소장을 바로 연결하지 않고, 나중에 환자가 안정된 후에 연결하는 방법을 선택할 수 있습니다. 수술 도중 감염이나 출혈이 심해지면 추가적인 처치가 필요할 수 있습니다. 신장(콩팥) 기능이 좋지 않기 때문에, 수술 중이나 후에 신장 관련 처치가 추가될 수도 있습니다. 알레르기 병력이 있으므로, 약물이나 수술 재료에 반응이 나타나면 즉시 대처할 예정입니다. 이런 모든 변화는 환자의 안전을 위해 꼭 필요한 경우에만 시행합니다.",
    "method_4": "이번 수술은 위궤양 천공 때문에 위의 일부를 절제하는 큰 수술입니다. 수술 중에는 출혈(피가 나는 것)이 생길 수 있어서, 필요하다면 수혈(다른 사람의 피를 받는 것)을 해야 할 수도 있습니다. 위절제술은 출혈 위험이 비교적 높은 수술에 속하므로, 수술 전 미리 수혈 가능성을 안내드립니다. 만약 수술 중이나 후에 피가 많이 나서 몸에 필요한 피가 부족해지면, 안전하게 수혈을 진행하게 됩니다. 수혈은 생명을 지키기 위해 꼭 필요한 경우에만 시행합니다. 수혈을 할 때는 여러 검사를 통해 최대한 안전하게 진행하며, 부작용이 생길 가능성은 매우 낮지만 드물게 알레르기 반응이나 감염 등이 생길 수 있습니다. 수혈이 필요한 상황이 오지 않도록 최대한 조심해서 수술을 진행하겠지만, 혹시 모를 상황에 대비해 설명드리는 점 양해 부탁드립니다.",
    "method_5": "수술은 원래 담당하는 외과 전문의가 진행할 예정입니다. 하지만 수술 중 예상치 못한 상황이 생기거나, 담당 의사가 갑자기 수술을 계속할 수 없는 경우가 생길 수 있습니다. 이런 경우에는 같은 외과팀의 다른 전문의가 대신 수술을 이어서 진행할 수 있습니다. 이는 환자의 안전을 위해 꼭 필요한 조치입니다. 수술 중에는 여러 의료진이 함께 협력하여 환자를 돌보고, 필요할 때는 역할을 바꿀 수도 있습니다. 만약 담당 의사가 바뀌게 된다면, 바뀐 의료진도 충분한 경험과 자격을 갖춘 사람입니다. 이런 상황이 발생해도 환자에게 해가 가지 않도록 최선을 다합니다. 수술 전이나 수술 중에 의료진이 바뀔 수 있다는 점을 미리 알려드립니다.",
    "complications": "수술 후에는 여러 가지 합병증이 생길 수 있습니다. 출혈이 생기거나, 수술 부위에 감염이 생길 수 있습니다. 드물게는 장이 막히거나(장폐색), 수술 부위가 잘 아물지 않아 음식물이 새는 누공이 생길 수 있습니다. 또, 위를 일부 절제하면 소화가 잘 안 되거나, 체중이 줄고 영양 상태가 나빠질 수 있습니다. 흡연을 하면 상처가 잘 낫지 않거나 감염 위험이 더 높아질 수 있습니다. 신장(콩팥) 기능이 좋지 않은 경우, 회복이 더딜 수 있고, 드물게 신장에 무리가 갈 수 있습니다. 알레르기가 있다면, 마취나 약물에 반응이 나타날 수 있으니 주의가 필요합니다. 수술 후에는 복통, 메스꺼움, 구토 등이 있을 수 있지만 대부분 시간이 지나면 좋아집니다. 아주 드물게는 생명을 위협하는 심각한 합병증이 생길 수 있으니, 이상 증상이 있으면 바로 의료진에게 알려야 합니다.",
    "preop_care": "수술 중이나 수술 후에 갑자기 출혈, 쇼크, 호흡 곤란 같은 응급상황이 생길 수 있습니다. 이런 일이 발생하면 의료진이 바로 심폐소생술, 수혈, 추가 수술 등 필요한 조치를 신속하게 시행합니다. 위나 소장에 구멍이 더 커지거나, 주변 장기에 손상이 생길 경우 추가적인 절제나 봉합이 필요할 수 있습니다. 심한 출혈이 멈추지 않으면 혈관을 묶거나, 더 넓은 부위를 절제할 수도 있습니다. 알레르기 반응이 나타나면 즉시 약물 투여나 기도 확보 등으로 대응합니다. 신장(콩팥) 기능에 문제가 있으므로, 수분 조절이나 투석이 필요할 수도 있습니다. 흡연 이력이 있어 호흡기 문제가 생기면 산소 공급이나 기도 관리가 필요할 수 있습니다. 모든 응급조치는 환자의 생명을 최우선으로 생각하여 빠르게 진행됩니다.",
    "mortality_risk": "이 수술은 위궤양 천공으로 인해 위의 일부를 절제하는 큰 수술입니다. 대부분의 젊고 건강한 사람들은 잘 회복하지만, 위나 소장에 구멍이 생겼을 때는 생명을 위협할 수 있는 위험이 있습니다. 수술 중이나 수술 후에 출혈, 감염, 장기 기능 저하 등 심각한 문제가 생길 수 있고, 드물게는 사망에 이를 수도 있습니다. 특히 신장(콩팥)에 문제가 있거나, 흡연을 하는 경우에는 회복이 더 느릴 수 있습니다. 하지만 현재 환자 상태가 안정적이기 때문에 위험이 크게 높지는 않습니다. 그래도 모든 수술에는 예기치 못한 위험이 따르므로, 의료진이 최선을 다해 안전하게 수술을 진행할 예정입니다. 수술 전후로 몸 상태가 갑자기 나빠질 수 있으니, 이상 증상이 있으면 바로 알려주셔야 합니다."
  },
  "canvas_counts": {
    "canvas_count_signature": 1,
    "canvas_count_7": 1
  },
  "canvas_drawings": {},
  "canvas_images": {},
  "timestamp": "2025-07-10T02:39:20.720273"
}