{
  "patient_info": {
    "등록번호": "6767",
    "수술명": "하트만 수술",
    "환자명": "김민준",
    "시행예정일": "2025-06-29",
    "나이": "19",
    "성별": "M",
    "진단명": "Sigmoid colon perforation",
    "수술부위표시": "R",
    "수술부위": "좌측",
    "의료진": [
      {
        "집도의": "서원",
        "전문의여부": "전문의",
        "진료과목": "외과"
      }
    ],
    "과거병력": "false",
    "당뇨병": "false",
    "흡연유무": "false",
    "고혈압": "false",
    "알레르기": "false",
    "저혈압": "false",
    "기도이상": "false",
    "심혈관질환": "true",
    "호흡기질환": "false",
    "혈액응고 관련 질환": "false",
    "복용약물": "false",
    "신장질환": "false",
    "마약복용 혹은 약물사고": "false",
    "기타": "없음"
  },
  "form_data": {},
  "session_consent_data": {
    "no_surgery_prognosis": "수술을 받지 않으면 에스상결장 천공(대장에 구멍이 난 상태) 때문에 배 안에 세균과 오염물질이 퍼질 수 있습니다. 이로 인해 복막염(배 안에 염증이 생기는 병)이 생기고, 몸 전체에 감염이 퍼져 생명이 위험해질 수 있습니다. 치료를 받지 않으면 고열, 심한 복통, 구토, 혈압 저하 등 증상이 심해질 수 있습니다. 시간이 지날수록 장기(심장, 폐, 신장 등)가 제대로 작동하지 않을 수 있습니다. 특히 젊은 나이라도 이런 상태가 오래 지속되면 회복이 어렵고, 사망할 위험도 높아집니다. 약물치료나 안정만으로는 천공된 장을 막거나 오염을 해결할 수 없습니다. 따라서 수술 없이 두면 상태가 급격히 나빠질 수 있습니다.",
    "alternative_methods": "하트만 수술 외에도 몇 가지 다른 치료 방법이 있습니다. 첫 번째로, 일부 경우에는 에스상결장 절제술(에스상결장만 잘라내는 수술)이 고려될 수 있습니다. 하지만 천공이 심하거나 감염이 넓게 퍼진 경우에는 하트만 수술이 더 안전할 수 있습니다. 두 번째로, 상태가 아주 가볍다면 항생제 치료와 같은 비수술적 방법을 시도할 수 있지만, 대부분의 천공 환자에게는 효과가 부족합니다. 또 다른 방법으로는 손상된 장을 잘라내고 바로 다시 연결하는 수술(1차 문합술)이 있지만, 감염 위험이 높을 때는 권장되지 않습니다. 환자의 심장 질환 등 건강 상태에 따라 치료 방법이 달라질 수 있습니다. 모든 치료 방법에는 각각 장점과 단점이 있으니, 담당 의사와 충분히 상의하는 것이 중요합니다. 치료를 늦추면 생명이 위험해질 수 있으니, 빠른 결정이 필요합니다.",
    "purpose": "하트만 수술은 에스상결장(대장의 일부)에 구멍이 생겨서 시행하는 수술입니다. 대장에 구멍이 나면 배 안에 세균이나 오염물이 퍼져서 생명을 위협할 수 있습니다. 이 수술은 터진 대장 부분을 잘라내고, 남은 대장의 끝을 밖으로 빼내어 인공항문(장루)을 만드는 방법입니다. 이렇게 하면 오염된 부분을 제거하고, 배 안의 감염을 막을 수 있습니다. 수술을 하지 않으면 복막염이나 패혈증 같은 심각한 합병증이 생길 수 있습니다. 수술 후에는 인공항문을 통해 대변을 보게 되지만, 상태가 좋아지면 나중에 다시 연결하는 수술을 할 수도 있습니다. 이 수술은 생명을 지키기 위해 꼭 필요한 치료입니다.",
    "method_1": "하트만 수술은 에스상결장(대장의 끝부분)에 구멍이 생겨서 이를 치료하기 위해 시행하는 수술입니다. 이 수술에서는 문제가 생긴 에스상결장 부분을 잘라내고, 남은 대장 끝을 복부에 연결해서 인공항문(장루)을 만듭니다. 이렇게 하면 대변이 자연스럽게 항문으로 나가지 않고, 복부에 만든 구멍을 통해 배출됩니다. 수술 후에는 장루 주머니를 차고 생활해야 하며, 나중에 상태가 좋아지면 다시 연결하는 수술을 할 수도 있습니다. 수술은 전신마취로 진행되며, 보통 2~3시간 정도 걸립니다. 수술 후에는 통증, 감염, 출혈, 장폐색 같은 합병증이 생길 수 있지만, 대부분 잘 회복됩니다. 심장 질환이 있는 경우에는 수술 전후로 심장 상태를 더 꼼꼼히 살펴야 합니다. 이 수술은 생명을 지키기 위해 꼭 필요한 치료입니다.",
    "method_2": "하트만 수술은 보통 2시간에서 4시간 정도 걸립니다. 수술 시간은 환자의 상태나 장기의 손상 정도에 따라 달라질 수 있습니다. 에스상결장 천공이 있어서 주변 조직의 상태를 확인하고, 손상된 부위를 잘라내는 과정이 필요합니다. 수술 중 예상치 못한 문제가 생기면 시간이 더 길어질 수 있습니다. 하지만 환자 상태가 안정적이기 때문에 일반적으로 3시간 안팎으로 끝나는 경우가 많습니다. 수술이 끝난 후에도 회복실에서 상태를 확인하는 시간이 추가로 필요합니다. 전체적으로 병원에서 보내는 시간은 더 길 수 있으니 참고해 주세요.",
    "method_3": "수술 중 예상치 못한 상황이 생길 수 있어서, 수술 방법이 바뀌거나 추가될 수 있습니다. 예를 들어, 천공이 생각보다 넓거나 주변 장기가 손상된 경우, 더 넓은 부위를 절제해야 할 수도 있습니다. 출혈이 심하거나 감염이 의심되면 추가적인 처치가 필요할 수 있습니다. 원래 계획한 하트만 수술 대신, 장을 다시 연결하는 수술(문합술)로 바뀔 수도 있습니다. 심장이나 혈관에 문제가 생기면 수술을 잠시 멈추고 응급 처치를 해야 할 수도 있습니다. 수술 중 다른 장기(예: 방광, 소장 등)에 손상이 생기면 그 부분도 함께 치료해야 합니다. 이런 변화는 환자의 안전을 위해 꼭 필요한 경우에만 진행됩니다. 모든 변화는 수술 후 보호자에게 자세히 설명드릴 예정입니다.",
    "method_4": "하트만 수술은 에스상결장(대장의 한 부분)에 구멍이 생겨 시행하는 큰 수술입니다. 수술 중에는 출혈이 생길 수 있는데, 이때 피가 많이 부족해지면 수혈이 필요할 수 있습니다. 수혈이란 다른 사람의 피를 몸에 넣어주는 치료입니다. 대부분의 경우 수술 전후로 출혈을 최대한 줄이려고 노력하지만, 갑자기 피가 많이 나올 수도 있습니다. 특히 대장에 구멍이 생긴 경우에는 출혈 위험이 더 높아집니다. 만약 수혈이 필요하다면, 의료진이 안전하게 진행합니다. 수혈에는 드물게 알레르기 반응이나 감염 같은 부작용이 생길 수 있지만, 이런 위험은 매우 낮습니다. 수술 중이나 후에 수혈이 꼭 필요한 상황이 생길 수 있다는 점을 미리 알려드립니다.",
    "method_5": "수술은 원래 외과 전문의가 진행할 예정이지만, 예기치 못한 상황이 생길 수 있습니다. 예를 들어, 담당 선생님이 갑자기 아프거나 응급 상황이 생기면, 다른 외과 전문의가 대신 수술을 할 수도 있습니다. 이런 경우에도 환자의 안전을 위해 경험이 충분한 의사가 수술을 맡게 됩니다. 수술 중에는 여러 의료진이 함께 협력하여 진행하므로, 담당 선생님이 잠시 자리를 비우더라도 다른 의사가 바로 이어서 수술을 계속할 수 있습니다. 만약 수술 중에 예상치 못한 문제가 발생하면, 더 많은 전문가가 함께 참여할 수도 있습니다. 이런 변화는 모두 환자의 안전과 치료를 최우선으로 생각해서 결정됩니다. 수술 전이나 중간에 담당 의사가 바뀔 가능성이 있다는 점을 미리 알려드립니다.",
    "complications": "하트만 수술을 받으면 몇 가지 합병증이 생길 수 있습니다. 수술 부위에 감염이 생기거나, 출혈이 발생할 수 있습니다. 장이 막히는 장폐색이나, 장이 꼬이는 장염전이 생길 수도 있습니다. 드물게는 남은 장에 혈액이 잘 통하지 않아 장허혈이 올 수 있습니다. 수술 후 배에 고름이 고이거나, 상처가 잘 아물지 않을 수도 있습니다. 일시적으로 배변이 불편하거나, 인공항문(장루) 관리에 어려움을 겪을 수 있습니다. 심장 질환이 있는 경우, 수술 중이나 후에 심장에 무리가 갈 수 있습니다. 이런 합병증이 생기면 추가 치료나 재수술이 필요할 수 있습니다. 대부분은 잘 관리되지만, 이상 증상이 있으면 바로 의료진에게 알려야 합니다.",
    "preop_care": "수술 중이나 수술 후에 갑자기 문제가 생길 수 있습니다. 예를 들어, 심장이 멈추거나(심정지), 호흡이 어려워질 수 있습니다. 이런 응급상황이 발생하면, 의료진은 심폐소생술(심장과 폐를 다시 움직이게 하는 응급처치)을 시행할 수 있습니다. 또, 출혈이 심하게 생기면 추가 수술이나 수혈이 필요할 수 있습니다. 감염이 심해지면 항생제 치료나 추가적인 처치가 필요할 수 있습니다. 만약 심장에 문제가 생기면, 심장전문의와 함께 빠르게 치료를 시작합니다. 모든 응급상황에서는 환자의 생명을 최우선으로 생각하여 신속하게 조치를 취합니다. 응급조치가 필요한 경우 보호자에게 최대한 빨리 알릴 예정입니다.",
    "mortality_risk": "하트만 수술은 에스상결장 천공(장에 구멍이 난 상태)을 치료하기 위해 시행되는 큰 수술입니다. 이 수술로 인해 생명을 잃을 위험(사망 위험)은 약 2% 정도로, 100명 중 2명꼴입니다. 환자분은 젊고 전반적으로 건강하지만, 심혈관 질환(심장 관련 질환)이 있어 위험이 조금 더 높아질 수 있습니다. 심장에 문제가 있는 경우, 수술 중이나 후에 심장에 부담이 갈 수 있습니다. 하지만 현재 환자분의 상태는 안정적이어서, 위험이 크게 높지는 않습니다. 수술 전후로 의료진이 심장 상태를 잘 관리할 예정입니다. 모든 수술에는 예기치 못한 위험이 있지만, 최대한 안전하게 진행하겠습니다. 궁금한 점이 있으면 언제든지 말씀해 주세요."
  },
  "canvas_counts": {
    "canvas_count_9": 1,
    "canvas_count_4": 1,
    "canvas_count_2": 1
  },
  "canvas_drawings": {},
  "canvas_images": {},
  "timestamp": "2025-06-29T15:15:10.217826"
}